# -*- coding:utf-8 -*-
import re
import pandas as pd
import numpy as np
import datetime
import os.path
import glob
from sklearn.externals import joblib

DEBUG = False
def make_one_hot(name):
    trainer_list = ["배휴준", "이인호", "박병일", "지용철", "이광복", "김학수", "서정하", "강형곤", "임한", "이상영", "김일성", "배리", "곽영효", "윤영귀", "박원덕", "김혜성", "백광열", "강명준", "타카하시", "배대선", "이관호", "사이토", "오문식", "김양선", "알라이히", "심승태", "라이스", "구영준", "브루스", "박덕준", "양희진", "서홍수", "송문길", "박종곤", "최용구", "홍대유", "강병은", "정호익", "최기홍", "허재영", "야스다", "김재섭", "김충근", "안해양", "이왕언", "민장기", "김동철", "김윤섭", "김춘근", "임금만", "이희영", "장세한", "유충열", "후지타", "유재길", "유병복", "울즐리", "최봉주", "브라이언", "임봉춘", "이성일", "채플하임", "박천서", "양귀선", "김명국", "구자흥", "박대흥", "손영표", "황영원", "한일영", "지용훈", "밀러드", "핼포드", "박흥진", "신삼영", "레슬리쿠", "김길중", "김영관", "하재흥", "문제복", "안우성", "방동석", "아라야마", "양재철", "김순근", "서인석", "타카노", "김점오", "알윈탄", "박재우", "최혜식", "고홍석", "안병기", "박윤규", "최상식", "딘윌리엄", "김병학", "최영주", "신우철", "김병용", "박희철", "김대근", "김상석", "무하이리", "우창구", "김남중", "김창옥", "권승주", "오토나시", "키저", "테루노부", "윤치운", "고옥봉", "이신영", "하시모토", "마츠우라", "강승영", "정지은", "김효섭", "한상복", "박진호", "데스몬드", "이종구", "서범석", "김문갑", "조용배", "천창기", "김동균", "김호"]
    res = np.zeros(len(trainer_list))
    for i in range(len(trainer_list)):
        if name == trainer_list[i]:
            res[i] = 1
    return res

def get_trainer(name):
    return make_one_hot(name)


if __name__ == '__main__':
    print(len(get_trainer("이인호")))

